<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ServiceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('services')
            ->insert([
                ['name'=>'Укладання плитки на підлогу','type_id'=>1,'unit'=>'м.кв.','price'=>294],
                ['name'=>'Укладання плитки на стіни','type_id'=>1,'unit'=>'м.кв.','price'=>311],
                ['name'=>'Грунтовка стяжки під плітку','type_id'=>1,'unit'=>'м.кв.','price'=>14],
                ['name'=>'Резка плитки, шліфування кромок','type_id'=>1,'unit'=>'м.пог.','price'=>161],
                ['name'=>'Установка кутів при укладанні плитки','type_id'=>1,'unit'=>'м.пог.','price'=>56],
                ['name'=>'Фарбування стін водоемульсійною фарбою','type_id'=>2,'unit'=>'м.кв.','price'=>64],
                ['name'=>'Фарбування стелі водоемульсійною фарбою','type_id'=>2,'unit'=>'м.кв.','price'=>75],
                ['name'=>'Фарбування стелі фарбопультом (пульвер)','type_id'=>2,'unit'=>'м.кв.','price'=>81],
                ['name'=>'Фарбування стін фарбопультом (пульвер)','type_id'=>2,'unit'=>'м.кв.','price'=>76],
                ['name'=>'Грунтування під стяжку','type_id'=>2,'unit'=>'м.кв.','price'=>15],
                ['name'=>'Стартова штукатурка (стіна по маяках або стелю під правило)','type_id'=>3,'unit'=>'м.кв.','price'=>139],
                ['name'=>'Ручна маячная штукатурка (до 2 см)','type_id'=>3,'unit'=>'м.кв.','price'=>140],
                ['name'=>'Ручна маячная штукатурка (більше 2 см)','type_id'=>3,'unit'=>'м.кв.','price'=>166],
                ['name'=>'Штроблення під проводку в бетоні, глибина штроби 2 см','type_id'=>4,'unit'=>'м.пог.','price'=>71],
                ['name'=>'Штроблення під проводку в цеглі, глибина штроби 2 см','type_id'=>4,'unit'=>'м.пог.','price'=>50],
                ['name'=>'Пристрій ніші (цегла)','type_id'=>4,'unit'=>'шт.','price'=>422],
                ['name'=>'Пристрій ніші (бетон)','type_id'=>4,'unit'=>'шт.','price'=>686],
                ['name'=>'Штроблення під труби в бетоні, глибина штроби 5 см','type_id'=>5,'unit'=>'м.пог.','price'=>129],
                ['name'=>'Штроблення під труби в цеглі, глибина штроби 5 см','type_id'=>5,'unit'=>'м.пог.','price'=>95],
                ['name'=>'Демонтаж ванни сантехніком','type_id'=>5,'unit'=>'шт.','price'=>305],
                ['name'=>'Демонтаж каналізації сантехніком','type_id'=>5,'unit'=>'м.пог.','price'=>63],
                ['name'=>'Монтаж газового котла до 55 кВт','type_id'=>6,'unit'=>'шт.','price'=>820],
                ['name'=>'Демонтаж газового котла.','type_id'=>6,'unit'=>'шт.','price'=>609],
                ['name'=>'Установка батареї опалення','type_id'=>6,'unit'=>'шт.','price'=>615],
                ['name'=>'Підключення батареї опалення','type_id'=>6,'unit'=>'шт.','price'=>306],
                ['name'=>'Утеплення фасаду. Комплекс (сітка, утеплювач, баранчик, фарбування)','type_id'=>7,'unit'=>'м.кв.','price'=>378],
                ['name'=>'Утеплення фасаду. Комплекс (сітка, утеплювач, короїд, фарбування)','type_id'=>7,'unit'=>'м.кв.','price'=>377],
                ['name'=>'Грунтовка поверхні фасаду','type_id'=>7,'unit'=>'м.кв.','price'=>21],
                ['name'=>'Монтаж утеплювача на фасад','type_id'=>7,'unit'=>'м.кв.','price'=>111],
                ['name'=>'Монтаж армосеткі для фасаду','type_id'=>7,'unit'=>'м.кв.','price'=>78],
                ['name'=>'Стіна з газоблоку або піноблоку','type_id'=>8,'unit'=>'м.куб.','price'=>745],
                ['name'=>'Кладка стіни з керамоблока','type_id'=>8,'unit'=>'м.куб.','price'=>948],
                ['name'=>'Кладка облицювальної цегли на фасад','type_id'=>8,'unit'=>'м.кв.','price'=>650],
                ['name'=>'Копання траншеї вручну під фундамент','type_id'=>9,'unit'=>'м.куб.','price'=>386],
                ['name'=>'Зворотне засипання траншеї для фундаменту','type_id'=>9,'unit'=>'м.куб.','price'=>211],
                ['name'=>'Створення піщаної подушки з ущільненням для фундаменту','type_id'=>9,'unit'=>'м.куб.','price'=>301],
                ['name'=>'Виготовлення та встановлення опалубки для фундаменту','type_id'=>9,'unit'=>'м.кв.','price'=>187],
                ['name'=>'УПристрій стрічкового фундаменту','type_id'=>9,'unit'=>'м.куб.','price'=>1326],
            ]);
    }
}
