@extends('layouts.master')
@section('content')


        <div class="block">
            <a class="button" href="{{route('home')}}">
                <i class="fa fa-calculator"  aria-hidden="true"></i>Почати новий розрахунок
            </a>
        </div>
        <div class="page">
            <h1 class="page__title page__title_mt3 page__title_mb">Будівельний калькулятор онлайн</h1>
            <div class="page__text">
                <p>
                    Калькулятор ремонту онлайн це дійсно проста і дуже зручна послуга. Ми переконані, що вона вам стане в нагоді при будь-яких будівельних роботах Калькулятор ремонту працює дуже просто: Ви вказуєте площу вашого приміщення або окремої його частини і калькулятор ремонту квартири практично моментально складає кошторис робіт на підставі сьогоднішніх середніх цін по країні.
                    <br>
                    <br>
                    Ціни враховуються на підставі прайс-листів 50 000 будівельників. Нічого більш точного в Україні немає. Після розрахунку Ви зможете дізнатися заздалегідь, яку приблизно суму вам доведеться витратити на необхідні роботи. Якщо ви сумніваєтеся в якихось будівельних рішеннях, калькулятор вартості ремонту квартири допоможе вам визначитися.
                </p>
                <p>
                    Особливо ця послуг буде корисна для тих, хто збирається робити капітальний ремонт квартири або приміщення. Калькулятор нашого сервісу зможе прорахувати всю вартість робіт до дрібниць.
                </p>
                <h2 class="page__subtitle page__subtitle_mb">Які є можливості при розрахунку ремонту</h2>
                <p>
                    1. Зберегти розрахунок і зберігати необмежену кількість розрахунків в особистому кабінеті будь-який час.
                    <br>
                    2. Зберегти в PDF форматі.
                    <br>
                    3. Давати назву розрахункам та короткий опис.
                </p>
            </div>
        </div>



@endsection
